Процедура ОбработкаПроведения(Отказ, Режим)  
	#Область ЗапросНоменклатурыИзДокумента
	Запрос = Новый Запрос;          
	МенеджерВТ = Новый МенеджерВременныхТаблиц;  
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;    
	
		Запрос.Текст = "ВЫБРАТЬ
	                |	ПродажаТовараНоменклатура.Номенклатура КАК Номенклатура,
	                |	СУММА(ПродажаТовараНоменклатура.Количество) КАК Количество
	                |ПОМЕСТИТЬ НоменклатураДокумента
	                |ИЗ
	                |	Документ.РасходнаяНакладная.Номенклатура КАК ПродажаТовараНоменклатура
	                |ГДЕ
	                |	ПродажаТовараНоменклатура.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПродажаТовараНоменклатура.Номенклатура
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	НоменклатураДокумента.Номенклатура КАК Номенклатура,
	                |	НоменклатураДокумента.Количество КАК Количество
	                |ИЗ
	                |	НоменклатураДокумента КАК НоменклатураДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
      РезультатЗапроса = Запрос.Выполнить(); 
	#КонецОбласти
	
	#Область ЗаписьВРегистр
	ВыборкаТовары = РезультатЗапроса.Выбрать(); 
	Пока ВыборкаТовары.Следующий() Цикл       
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаТовары.Номенклатура;
		Движение.Количество = ВыборкаТовары.Количество;
	КонецЦикла;                                                      

	Движения.Товары.Записать();       
	#КонецОбласти
	
      #Область КонтрольОстатков	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
				  "ВЫБРАТЬ
				  |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
				  |	ТоварыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
				  |	ТоварыОстатки.Номенклатура КАК Номенклатура
				  |ИЗ
				  |	РегистрНакопления.Товары.Остатки(
				  |			&МоментВремени,
				  |			Номенклатура В
				  |				(ВЫБРАТЬ
				  |					НоменклатураДокумента.Номенклатура
				  |				ИЗ
				  |					НоменклатураДокумента)) КАК ТоварыОстатки
				  |ГДЕ
				  |	ТоварыОстатки.КоличествоОстаток < 0";
		
		   ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		   Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);

		   РезультатЗапросаНехваткаТоваров = Запрос.Выполнить(); 
		   ВыборкаДетальныеЗаписи = РезультатЗапросаНехваткаТоваров.Выбрать();
		   
		   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не хватает товара: " + Строка(ВыборкаДетальныеЗаписи.НоменклатураПредставление) + 
				" " + Строка(-ВыборкаДетальныеЗаписи.КоличествоОстаток) +
				" единиц.";
				Сообщение.Сообщить();
				Отказ = Истина;
		  КонецЦикла;        
			
	КонецЕсли;
		
      #КонецОбласти
	  
КонецПроцедуры
